bolknote/MK61S_MINI/code/config.h
//#define CDU
//#define LK432
//#define SERIAL_OUTPUT
// Ревизию платы можно выбрать при сборке (`-DREVISION_V2`). В релизных
// сборках по умолчанию используется V3, но нельзя неявно определять V3 поверх
// явно заданного профиля V2: различаются выводы данных LCD и зуммер.
#if defined(REVISION_V2) && defined(REVISION_V3)
  #error "Select only one MK61s-mini board revision"
#endif
#if !defined(REVISION_V2) && !defined(REVISION_V3)
  #define REVISION_V3
#endif

// В Mini V2 линия LCD DB7 подключена к PC15/OSC32_OUT, поэтому включение LSE
// отбирает сигнал у LCD, а электрическая нагрузка дисплея мешает генератору.
// Штатный источник здесь LSI. В CDU оба вывода LSE также заняты. На остальных
// поддерживаемых платах можно попробовать запустить LSE и перейти на LSI, если
// запуск не удался.
#if defined(REVISION_V2) || defined(CDU)
  static constexpr bool MK61_RTC_LSE_AVAILABLE = false;
#else
  static constexpr bool MK61_RTC_LSE_AVAILABLE = true;
#endif
#define MK61s
//#define MK52s

// Встроенный FOCAL включен по умолчанию. Поставьте 0, чтобы убрать его
// редактор, рантайм и меню из прошивки.
#ifndef MK61_ENABLE_FOCAL
  #define MK61_ENABLE_FOCAL 1
#endif
#if MK61_ENABLE_FOCAL != 0 && MK61_ENABLE_FOCAL != 1
  #error "MK61_ENABLE_FOCAL must be 0 or 1"
#endif

// TinyBASIC включен по умолчанию. Поставьте 0, чтобы убрать его
// редактор, рантайм и меню из прошивки.
#ifndef MK61_ENABLE_TINYBASIC
  #define MK61_ENABLE_TINYBASIC 1
#endif
#if MK61_ENABLE_TINYBASIC != 0 && MK61_ENABLE_TINYBASIC != 1
  #error "MK61_ENABLE_TINYBASIC must be 0 or 1"
#endif

// USB-экран хранит собственный монохромный кадровый буфер 192x64 за обычным
// API дисплея. По умолчанию он выключен, поскольку статические буферы расходуют
// ОЗУ. Этот ключ также разрешает сборку графических файловых модулей для
// LCD1602; их запуск всё равно требует активной сессии виртуального экрана.
#ifndef MK61_ENABLE_USB_SCREEN
  #define MK61_ENABLE_USB_SCREEN 0
#endif
#if MK61_ENABLE_USB_SCREEN != 0 && MK61_ENABLE_USB_SCREEN != 1
  #error "MK61_ENABLE_USB_SCREEN must be 0 or 1"
#endif

// WS0010 exposes 100x16 controller GDRAM, of which the qualified WEH001602A
// panel connects 80x16 pixels to the visible 16x2 OLED window.  The exact
// F411 mini V3 profile has passed the physical geometry/mode-isolation tests;
// other MCUs and board revisions keep graphics laboratory-only even when an
// explicit build flag compiles the same controller API.
#ifndef MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED
  #if defined(STM32F411xE) && defined(REVISION_V3) && \
      defined(MK61_OLED1602_WS0010)
    #define MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED 1
  #else
    #define MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED 0
  #endif
#endif
#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED != 0 && \
    MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED != 1
  #error "MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED must be 0 or 1"
#endif
#if MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED && \
    (!defined(STM32F411xE) || !defined(REVISION_V3) || \
     !defined(MK61_OLED1602_WS0010))
  #error "qualified WS0010 graphics requires F411 mini V3/WS0010"
#endif

// Preserve the established build flag name because it describes the full
// controller address space.  Production defaults it on only for the qualified
// profile above; an explicit 0 remains a supported feature opt-out.
#ifndef MK61_WS0010_GRAPHICS_100X16
  #define MK61_WS0010_GRAPHICS_100X16 \
    MK61_WS0010_GRAPHICS_PROFILE_QUALIFIED
#endif
#if MK61_WS0010_GRAPHICS_100X16 != 0 && MK61_WS0010_GRAPHICS_100X16 != 1
  #error "MK61_WS0010_GRAPHICS_100X16 must be 0 or 1"
#endif
#if MK61_WS0010_GRAPHICS_100X16 && !defined(MK61_OLED1602_WS0010)
  #error "WS0010 100x16 graphics requires MK61_OLED1602_WS0010"
#endif

// На момент объявления файловых модулей полные профили ещё не раскрыты в
// MK61_DISPLAY_UC1609, поэтому учитываем и сами флаги готовых плат.
#if defined(MK61_DISPLAY_UC1609) || defined(DISPLAY_UC1609) || \
    defined(MK61_BOARD_CLASSIC_V2) || defined(MK61_BOARD_CLASSIC_V3) || \
    defined(MK61_BOARD_40TH) || MK61_ENABLE_USB_SCREEN
  #define MK61_HAS_COMPILED_GRAPHICS 1
#else
  #define MK61_HAS_COMPILED_GRAPHICS 0
#endif

// WBMP needs only a modal, page-major fullscreen bitmap target.  The hybrid
// WS0010 provides that target when its separately qualified G/C mode is built,
// while it deliberately remains outside MK61_HAS_COMPILED_GRAPHICS.
#if MK61_HAS_COMPILED_GRAPHICS || \
    (defined(MK61_OLED1602_WS0010) && MK61_WS0010_GRAPHICS_100X16)
  #define MK61_HAS_FULLSCREEN_BITMAP 1
#else
  #define MK61_HAS_FULLSCREEN_BITMAP 0
#endif

// T2/.md доступен на любом экране: LCD1602 получает семантический plain text,
// UC1609 и USB-экран — форматированный монохромный документ с WBMP-блоками.
#ifndef MK61_ENABLE_MARKDOWN_VIEWER
  #define MK61_ENABLE_MARKDOWN_VIEWER 1
#endif
#if MK61_ENABLE_MARKDOWN_VIEWER != 0 && MK61_ENABLE_MARKDOWN_VIEWER != 1
  #error "MK61_ENABLE_MARKDOWN_VIEWER must be 0 or 1"
#endif

// Графический Markdown сам открывает WBMP на любом fullscreen bitmap backend,
// включая квалификационную GDRAM WS0010 100x16. Отдельный viewer нужен только
// без Markdown.
#ifndef MK61_ENABLE_WBMP_VIEWER
  #define MK61_ENABLE_WBMP_VIEWER \
    (MK61_HAS_FULLSCREEN_BITMAP && !MK61_ENABLE_MARKDOWN_VIEWER)
#endif
#if MK61_ENABLE_WBMP_VIEWER != 0 && MK61_ENABLE_WBMP_VIEWER != 1
  #error "MK61_ENABLE_WBMP_VIEWER must be 0 or 1"
#endif

#define MK61_MARKDOWN_USES_WBMP \
  (MK61_ENABLE_MARKDOWN_VIEWER && MK61_HAS_FULLSCREEN_BITMAP)
#define MK61_STANDALONE_WBMP_VIEWER_ENABLED \
  (MK61_ENABLE_WBMP_VIEWER && !MK61_MARKDOWN_USES_WBMP)
#if MK61_STANDALONE_WBMP_VIEWER_ENABLED && !MK61_HAS_FULLSCREEN_BITMAP
  #error "MK61_ENABLE_WBMP_VIEWER requires UC1609, USB Screen, or WS0010 100x16 graphics"
#endif

// Консоль CHIP-8 выключена по умолчанию. C1 — двухбайтовый magic типа C6;
// .ch8 хранит стандартный сырой ROM без дополнительного заголовка.
#ifndef MK61_ENABLE_CHIP8
  #define MK61_ENABLE_CHIP8 0
#endif
#if MK61_ENABLE_CHIP8 != 0 && MK61_ENABLE_CHIP8 != 1
  #error "MK61_ENABLE_CHIP8 must be 0 or 1"
#endif
#if MK61_ENABLE_CHIP8 && !MK61_HAS_COMPILED_GRAPHICS
  #error "MK61_ENABLE_CHIP8 requires UC1609 or MK61_ENABLE_USB_SCREEN=1"
#endif

// Все внешние APP используют один runtime и ABI: FOCAL, TinyBASIC,
// просмотрщики, CHIP-8 и обычные APPLICATION отличаются только Kind и
// способом поиска файла. Каждый опциональный компонент имеет два
// ортогональных ключа: MK61_ENABLE_* включает функцию, *_AS_APP
// выбирает APP вместо resident. Так получаются три режима: выключен,
// встроен или APP. F411 по умолчанию встраивает включённые функции; другие
// MCU, в том числе F401, по умолчанию выносят их в APP.
#ifndef MK61_ENABLE_LOADABLE_MODULES
  #define MK61_ENABLE_LOADABLE_MODULES 1
#endif
#if MK61_ENABLE_LOADABLE_MODULES != 1
  #error "the unified APP loader is mandatory"
#endif

// Канонические System APP используют тот же загрузчик, startup, API и кэш,
// что APPLICATION. SETUP на F411 встроен в resident: обычная сборка Arduino
// IDE не запускает post-build для /System, а запаса Flash на F411 достаточно.
// На F401 он остаётся внешним, чтобы сохранить запас Flash.
#ifdef MK61_EXTERNALIZE_SYSTEM_APPS
  #error "MK61_EXTERNALIZE_SYSTEM_APPS was removed; use per-component *_AS_APP flags"
#endif

#if defined(STM32F411xE)
  #define MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP 0
#else
  #define MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP 1
#endif

