bolknote/MK61S_MINI/code/config.h
#ifndef MK61_FOCAL_AS_APP
  #define MK61_FOCAL_AS_APP MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP
#endif
#ifndef MK61_TINYBASIC_AS_APP
  #define MK61_TINYBASIC_AS_APP MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP
#endif
#ifndef MK61_WBMP_VIEWER_AS_APP
  #define MK61_WBMP_VIEWER_AS_APP MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP
#endif
#ifndef MK61_MARKDOWN_VIEWER_AS_APP
  #define MK61_MARKDOWN_VIEWER_AS_APP MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP
#endif
#ifndef MK61_CHIP8_AS_APP
  #define MK61_CHIP8_AS_APP MK61_DEFAULT_OPTIONAL_COMPONENT_AS_APP
#endif

#if MK61_FOCAL_AS_APP != 0 && MK61_FOCAL_AS_APP != 1
  #error "MK61_FOCAL_AS_APP must be 0 or 1"
#endif
#if MK61_TINYBASIC_AS_APP != 0 && MK61_TINYBASIC_AS_APP != 1
  #error "MK61_TINYBASIC_AS_APP must be 0 or 1"
#endif
#if MK61_WBMP_VIEWER_AS_APP != 0 && MK61_WBMP_VIEWER_AS_APP != 1
  #error "MK61_WBMP_VIEWER_AS_APP must be 0 or 1"
#endif
#if MK61_MARKDOWN_VIEWER_AS_APP != 0 && MK61_MARKDOWN_VIEWER_AS_APP != 1
  #error "MK61_MARKDOWN_VIEWER_AS_APP must be 0 or 1"
#endif
#if MK61_CHIP8_AS_APP != 0 && MK61_CHIP8_AS_APP != 1
  #error "MK61_CHIP8_AS_APP must be 0 or 1"
#endif

// FAT/LFN USB-диска по умолчанию встроен в F411, но лабораторная или
// специализированная сборка может явно вынести только его в USBDISK.APP.
// F401 по умолчанию оставляет этот крупный компонент внешним. Отдельный ключ
// нужен в том числе упаковщику: наличие файла в /System должно точно совпадать
// с тем, какую реализацию ожидает resident.
#ifndef MK61_EXTERNALIZE_USBDISK
  #if defined(STM32F411xE)
    #define MK61_EXTERNALIZE_USBDISK 0
  #else
    #define MK61_EXTERNALIZE_USBDISK 1
  #endif
#endif
#if MK61_EXTERNALIZE_USBDISK != 0 && MK61_EXTERNALIZE_USBDISK != 1
  #error "MK61_EXTERNALIZE_USBDISK must be 0 or 1"
#endif

// Выключенный компонент не занимает ни resident Flash, ни место в /System.
#define MK61_FOCAL_IS_LOADABLE \
  (MK61_ENABLE_FOCAL && MK61_FOCAL_AS_APP)
#define MK61_TINYBASIC_IS_LOADABLE \
  (MK61_ENABLE_TINYBASIC && MK61_TINYBASIC_AS_APP)
// NUMBER_IO нужен штатным языковым APP. Сборка без обоих языков сохраняет
// номера ABI-операций, но не объявляет capability и не держит реализацию в
// резидентной Flash.
#define MK61_NUMBER_IO_SERVICE_ENABLED \
  (MK61_ENABLE_FOCAL || MK61_ENABLE_TINYBASIC)
#define MK61_WBMP_VIEWER_IS_LOADABLE \
  (MK61_STANDALONE_WBMP_VIEWER_ENABLED && MK61_WBMP_VIEWER_AS_APP)
#define MK61_MARKDOWN_VIEWER_IS_LOADABLE \
  (MK61_ENABLE_MARKDOWN_VIEWER && MK61_MARKDOWN_VIEWER_AS_APP)
#define MK61_CHIP8_IS_LOADABLE \
  (MK61_ENABLE_CHIP8 && MK61_CHIP8_AS_APP)
#if defined(STM32F411xE)
  #define MK61_SETUP_IS_LOADABLE 0
#else
  #define MK61_SETUP_IS_LOADABLE 1
#endif
#define MK61_USBDISK_IS_LOADABLE (MK61_EXTERNALIZE_USBDISK)
// Терминальная справка остаётся отдельным ресурсом на обеих платформах.
#define MK61_TERMINAL_HELP_IS_EXTERNAL 1
#define MK61_ANY_LOADABLE_MODULE 1
#define MK61_APP_RUNTIME_AVAILABLE 1

#define MK61_USBDISK_IS_BUILTIN (!MK61_USBDISK_IS_LOADABLE)

#define MK61_FOCAL_IS_BUILTIN \
  (MK61_ENABLE_FOCAL && !MK61_FOCAL_AS_APP)
#define MK61_TINYBASIC_IS_BUILTIN \
  (MK61_ENABLE_TINYBASIC && !MK61_TINYBASIC_AS_APP)
#define MK61_WBMP_VIEWER_IS_BUILTIN \
  (MK61_STANDALONE_WBMP_VIEWER_ENABLED && !MK61_WBMP_VIEWER_AS_APP)
#define MK61_MARKDOWN_VIEWER_IS_BUILTIN \
  (MK61_ENABLE_MARKDOWN_VIEWER && !MK61_MARKDOWN_VIEWER_AS_APP)
#define MK61_CHIP8_IS_BUILTIN \
  (MK61_ENABLE_CHIP8 && !MK61_CHIP8_AS_APP)

// Графический Markdown владеет полным I1-viewer и WBMP-декодером: он показывает
// как локальные блоки изображений, так и самостоятельные .wbmp. Это правило
// одинаково для UC1609, USB Screen и квалификационной GDRAM WS0010 100x16.
#define MK61_IMAGE1_VIEWER_IS_BUILTIN \
  (MK61_WBMP_VIEWER_IS_BUILTIN || \
   (MK61_MARKDOWN_VIEWER_IS_BUILTIN && MK61_MARKDOWN_USES_WBMP))
#define MK61_WBMP_DECODER_IS_BUILTIN \
  (MK61_IMAGE1_VIEWER_IS_BUILTIN)

#define MK61_ANY_FULLSCREEN_FILE \
  (MK61_STANDALONE_WBMP_VIEWER_ENABLED || MK61_ENABLE_CHIP8 || \
   MK61_MARKDOWN_USES_WBMP || MK61_ANY_LOADABLE_MODULE)

// Расширенная ручная настройка строк, высоты, ширины и межстрочного интервала
// графического шрифта. По умолчанию в меню остается только выбор пресета шрифта.
#ifndef MK61_ENABLE_EXTENDED_FONT_SETTINGS
  #define MK61_ENABLE_EXTENDED_FONT_SETTINGS 0
#endif

// Математический бэкенд языков (FOCAL/TinyBASIC).
//  LIBM (умолчание) — трансцендентные функции через <math.h>.
//  CORE             — вычисление на ядре МК-61; убирает libm из прошивки
//                     ценой ~8 значащих цифр и меньшей скорости.
#define MK61_MATH_BACKEND_LIBM 0
#define MK61_MATH_BACKEND_CORE 1
#ifndef MK61_MATH_BACKEND
  #define MK61_MATH_BACKEND MK61_MATH_BACKEND_LIBM
#endif

// FOCAL/BASIC APP may carry a bounded single-precision libm subset while the
// resident keeps CORE math. Only that matched build needs the ABI conversion
// bridge; ordinary CORE builds must not pay for it in the tight F401 Flash.
#ifndef MK61_APP_LOCAL_FLOAT_MATH
  #define MK61_APP_LOCAL_FLOAT_MATH 0
#endif
#if MK61_APP_LOCAL_FLOAT_MATH != 0 && MK61_APP_LOCAL_FLOAT_MATH != 1
  #error "MK61_APP_LOCAL_FLOAT_MATH must be 0 or 1"
#endif

// Короткое нажатие [USER] открывает Проводник. Поставьте 0, чтобы оставить
// [USER] только для удержания стека и функций режима ПРГ.
#ifndef MK61_USER_EXPLORER_SHORTCUT
  #define MK61_USER_EXPLORER_SHORTCUT 1
#endif

#if defined(DISPLAY_UC1609) && !defined(MK61_DISPLAY_UC1609)
  #define MK61_DISPLAY_UC1609
#endif

#if defined(DISPLAY_LCD1602) && !defined(MK61_DISPLAY_LCD1602)
  #define MK61_DISPLAY_LCD1602
#endif

// Полные профили плат с UC1609. Classic V2 и V3 используют одинаковые дисплей
// и клавиатуру, но отличаются выводом буззера и полярностью LED.
//#define MK61_BOARD_CLASSIC_V2
//#define MK61_BOARD_CLASSIC_V3
//#define MK61_BOARD_40TH

#if (defined(MK61_BOARD_CLASSIC_V2) + defined(MK61_BOARD_CLASSIC_V3) + defined(MK61_BOARD_40TH)) > 1
  #error "Select only one UC1609 board profile"
#endif

#if defined(MK61_BOARD_CLASSIC_V2) || defined(MK61_BOARD_CLASSIC_V3)
  #if !defined(MK61_DISPLAY_UC1609)
    #define MK61_DISPLAY_UC1609
  #endif
  #if !defined(MK61_KEYBOARD_CLASSIC)
    #define MK61_KEYBOARD_CLASSIC
  #endif
#endif

// Профиль 40TH включает UC1609 и отдельную раскладку старой 40-клавишной версии.
#if defined(MK61_BOARD_40TH)
  #if !defined(MK61_DISPLAY_UC1609)
    #define MK61_DISPLAY_UC1609
  #endif
  #if !defined(MK61_KEYBOARD_40TH)
    #define MK61_KEYBOARD_40TH
  #endif
#endif

#if !defined(MK61_DISPLAY_UC1609)
  #define MK61_DISPLAY_LCD1602
#endif

// Proportional UI fonts belong to the UC1609 display profile, independently
// of whether it is driven by an F401 or F411.  Numeric overrides remain
// available for focused host/size tests.
#ifndef MK61_PROPORTIONAL_UI_FONTS
  #if defined(MK61_DISPLAY_UC1609)
    #define MK61_PROPORTIONAL_UI_FONTS 1
  #else
    #define MK61_PROPORTIONAL_UI_FONTS 0
  #endif
#endif
#if MK61_PROPORTIONAL_UI_FONTS != 0 && MK61_PROPORTIONAL_UI_FONTS != 1
  #error "MK61_PROPORTIONAL_UI_FONTS must be 0 or 1"
#endif
#if MK61_PROPORTIONAL_UI_FONTS && !defined(MK61_DISPLAY_UC1609)
  #error "proportional UI fonts require UC1609"
#endif

// Portable system modules are board-neutral by default, so their optional UI
// client needs an explicit build switch. UC1609 release bundles enable it and
// obtain glyphs from the resident service; character-display bundles omit it.
#ifndef MK61_PORTABLE_UI_FONTS
  #define MK61_PORTABLE_UI_FONTS 1
#endif
#if MK61_PORTABLE_UI_FONTS != 0 && MK61_PORTABLE_UI_FONTS != 1
  #error "MK61_PORTABLE_UI_FONTS must be 0 or 1"
#endif

#if MK61_PROPORTIONAL_UI_FONTS || \
    (defined(MK61_BUILD_PORTABLE_SYSTEM) && MK61_PORTABLE_UI_FONTS)
  #define MK61_UI_FONT_CLIENT 1
#else
  #define MK61_UI_FONT_CLIENT 0
#endif

// The dedicated calculator face is a property of the 192x64 UC1609 display,
// not of the STM32 model. It streams one page through the existing render
// buffer and has no proportional-font tables or second framebuffer, so the
// F401 build can use the same presentation without a RAM penalty.
#ifndef MK61_FIXED_CALCULATOR_FACE
  #if defined(MK61_DISPLAY_UC1609)
    #define MK61_FIXED_CALCULATOR_FACE 1
  #else
    #define MK61_FIXED_CALCULATOR_FACE 0
  #endif
#endif
#if MK61_FIXED_CALCULATOR_FACE != 0 && MK61_FIXED_CALCULATOR_FACE != 1
  #error "MK61_FIXED_CALCULATOR_FACE must be 0 or 1"
#endif
#if MK61_FIXED_CALCULATOR_FACE && !defined(MK61_DISPLAY_UC1609)
  #error "fixed calculator face requires UC1609"
#endif

// Read benchmarks are service diagnostics, not calculator functionality.
// Product F401 artifacts omit them; qualification and developer builds keep
// them. An explicit feature flag always wins.
#ifndef MK61_ENABLE_READ_BENCHMARKS
  #if MK61_F401_PRODUCT_BUILD
    #define MK61_ENABLE_READ_BENCHMARKS 0
  #else
    #define MK61_ENABLE_READ_BENCHMARKS 1
  #endif
#endif
#if MK61_ENABLE_READ_BENCHMARKS != 0 && MK61_ENABLE_READ_BENCHMARKS != 1
  #error "MK61_ENABLE_READ_BENCHMARKS must be 0 or 1"
#endif

// Raw ADC fields duplicate the user-facing Hardware report. Product F401
// artifacts omit only this terminal formatter; qualification images retain it.
#ifndef MK61_ENABLE_ANALOG_REPORT
  #if MK61_F401_PRODUCT_BUILD
    #define MK61_ENABLE_ANALOG_REPORT 0
  #else
    #define MK61_ENABLE_ANALOG_REPORT 1
  #endif
#endif
#if MK61_ENABLE_ANALOG_REPORT != 0 && MK61_ENABLE_ANALOG_REPORT != 1
  #error "MK61_ENABLE_ANALOG_REPORT must be 0 or 1"
#endif

// The file-oriented `prof save` formatter duplicates the interactive profiler
// output and costs meaningful Flash.  Keep it on the roomier F411
// qualification image.  F401 qualification builds retain interactive `prof`
// but omit only this duplicate save-to-file formatter; product F401 already
// omits the profiler itself.
#ifndef MK61_ENABLE_PROFILE_SAVE
  #if defined(STM32F401xC) || defined(STM32F401xE)
    #define MK61_ENABLE_PROFILE_SAVE 0
  #else
    #define MK61_ENABLE_PROFILE_SAVE 1
  #endif
#endif
#if MK61_ENABLE_PROFILE_SAVE != 0 && MK61_ENABLE_PROFILE_SAVE != 1
  #error "MK61_ENABLE_PROFILE_SAVE must be 0 or 1"
#endif

// Alarm scheduling is user-visible functionality, not a laboratory report.
// Keep the same command/API on F401 and F411; the constrained F401 release is
// built with size-LTO and retains its sealed-image reserve that way.
#ifndef MK61_ENABLE_RTC_ALARM_TERMINAL
  #define MK61_ENABLE_RTC_ALARM_TERMINAL 1
#endif
#if MK61_ENABLE_RTC_ALARM_TERMINAL != 0 && \
    MK61_ENABLE_RTC_ALARM_TERMINAL != 1
  #error "MK61_ENABLE_RTC_ALARM_TERMINAL must be 0 or 1"
#endif

#if defined(DISPLAY_LCD1602_A00) && !defined(MK61_LCD1602_A00)
  #define MK61_LCD1602_A00
#endif

#if defined(DISPLAY_LCD1602_A02) && !defined(MK61_LCD1602_A02)
  #define MK61_LCD1602_A02
#endif

