bolknote/MK61S_MINI/code/config.h
#define IS_CORTEX_M4() (__ARM_ARCH == 7)
//defined(__ARM_ARCH_7EM__)
//defined(__ARM_FEATURE_SIMD32)

// На STM32F4 горячие таблицы размещаются не в отдельном BSS, а в вытесняемом
// общем workspace: обычный калькулятор получает SRAM-ускорение, а Markdown,
// USB и System APP могут мгновенно вернуть все 8 КиБ и переключить ядро на
// Flash fallback. 0 = только Flash, 1 = микрокоманды/DCW (~1.1 КиБ),
// 2 = также AND_AMK (~7.1 КиБ суммарно).
#ifndef MK61_CORE_HOT_TABLES_IN_SRAM
  #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
    #define MK61_CORE_HOT_TABLES_IN_SRAM 2
  #else
    #define MK61_CORE_HOT_TABLES_IN_SRAM 0
  #endif
#endif
#if MK61_CORE_HOT_TABLES_IN_SRAM < 0 || MK61_CORE_HOT_TABLES_IN_SRAM > 2
  #error "MK61_CORE_HOT_TABLES_IN_SRAM must be 0, 1, or 2"
#endif

// Три последовательных Tick объединяются в один внешний вызов на микротакт.
// Тела остаются раздельными в исходнике, но встраиваются в общий wrapper:
// порядок эмуляции не меняется, а F411 тратит меньше времени на ABI-обвязку.
#ifndef MK61_CORE_MERGED_TICK
  #define MK61_CORE_MERGED_TICK 1
#endif
#if MK61_CORE_MERGED_TICK != 0 && MK61_CORE_MERGED_TICK != 1
  #error "MK61_CORE_MERGED_TICK must be 0 or 1"
#endif
#if MK61_CORE_MERGED_TICK && MK61_DWT_CORE_DETAIL
  #error "MK61_CORE_MERGED_TICK is incompatible with per-chip DWT detail"
#endif

// Research switch for a three-byte Cortex-M4 DSP selector in the merged Tick.
// It stays off until the same-device DWT A/B clears the >=3% full-step gate.
#ifndef MK61_CORE_PACKED_AMK
  #define MK61_CORE_PACKED_AMK 0
#endif
#if MK61_CORE_PACKED_AMK != 0 && MK61_CORE_PACKED_AMK != 1
  #error "MK61_CORE_PACKED_AMK must be 0 or 1"
#endif
#if MK61_CORE_PACKED_AMK && !MK61_CORE_MERGED_TICK
  #error "MK61_CORE_PACKED_AMK requires MK61_CORE_MERGED_TICK"
#endif

// Полное разворачивание расписания уменьшает цену внутреннего цикла.
// На F411 оно оказалось на 5.1% быстрее компактных циклов (+112 байт Flash).
#ifndef MK61_CORE_UNROLL_SCHEDULE
  #define MK61_CORE_UNROLL_SCHEDULE 1
#endif
#if MK61_CORE_UNROLL_SCHEDULE != 0 && MK61_CORE_UNROLL_SCHEDULE != 1
  #error "MK61_CORE_UNROLL_SCHEDULE must be 0 or 1"
#endif

// Host-only research counter for the three microprogram regions selected by
// every IK1302/03/06 command.  Firmware builds keep it at zero: the complete
// histogram needs 9 KiB and exists only to choose native hot paths from
// measured workloads rather than intuition.
#ifndef MK61_CORE_BODY_PROFILE
  #define MK61_CORE_BODY_PROFILE 0
#endif
#if MK61_CORE_BODY_PROFILE != 0 && MK61_CORE_BODY_PROFILE != 1
  #error "MK61_CORE_BODY_PROFILE must be 0 or 1"
#endif

#if defined(TERMINAL) || defined(DEBUG)
 //#warning Serial module included!
#endif

// Терминал использует Serial независимо от включенных отладочных категорий.
// Раньше SERIAL_OUTPUT появлялся только как побочный эффект DEBUG_* и сборка
// ломалась при отключении отладки с оставленным TERMINAL.
#if defined(TERMINAL) && !defined(SERIAL_OUTPUT)
  #define SERIAL_OUTPUT
#endif

#ifdef DEBUG_TRACE
  constexpr bool DBG_TRACE = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_TRACE = false;
#endif

#ifdef DEBUG_PARSE
  constexpr bool DBG_PARSE = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_PARSE = false;
#endif

#ifdef DEBUG_MEASURE
  constexpr bool DBG_MEASURE = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_MEASURE = false;
#endif

#ifdef DEBUG_MINI
  constexpr bool DBG_MINI = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_MINI = false;
#endif

#ifdef DEBUG_SPIFLASH
  constexpr bool DBG_SPIROM = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_SPIROM = false;
#endif

#ifdef DEBUG_DISASMBLER
  constexpr bool DBG_DISASM = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_DISASM = false;
#endif

#ifdef DEBUG_KBD
  constexpr bool DBG_KBD = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_KBD = false;
#endif

#ifdef DEBUG_MENU
  constexpr bool DBG_MENU = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_MENU = false;
#endif

#ifdef DEBUG_CORE61
  constexpr bool DBG_CORE61 = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_CORE61 = false;
#endif

#ifdef DEBUG_LIBRARY
  constexpr bool DBG_LIB61 = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_LIB61 = false;
#endif

#ifdef DEBUG_MK61E
  constexpr bool DBG_MK61E = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_MK61E = false;
#endif

#ifdef DEBUG_RUN_STOP
  constexpr bool DBG_EXT_RUN = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_EXT_RUN = false;
#endif

#ifdef MK61_FOCAL_TRACE
  constexpr bool DBG_FOCAL = true;
  #define SERIAL_OUTPUT
#else
  constexpr bool DBG_FOCAL = false;
#endif

#ifdef MK61s
  #if defined(MK61_BOARD_CLASSIC_V2)
    constexpr char MODEL[] = "MK61s-Classic-V2";
    //                       0123456789ABCDEF
    constexpr char FULL_MODEL_NAME[] = "MK61s Classic V2";
  #elif defined(MK61_BOARD_CLASSIC_V3)
    constexpr char MODEL[] = "MK61s-Classic-V3";
    //                       0123456789ABCDEF
    constexpr char FULL_MODEL_NAME[] = "MK61s Classic V3";
  #elif defined(MK61_BOARD_40TH)
    constexpr char MODEL[] = "MK61s-40th";
    //                       0123456789ABCDEF
    constexpr char FULL_MODEL_NAME[] = "MK61s-40thUC1609";
  #else
    constexpr char MODEL[] = "MK61s";
    //                       0123456789ABCDEF
    constexpr char FULL_MODEL_NAME[] = "MK61s *firmware*";
  #endif
#else
  #ifdef MK52s
    constexpr char MODEL[] = "MK52s";
    constexpr char FULL_MODEL_NAME[] = "MK52s *firmware*";
  #endif
#endif

// Отображается как "HHMMSS Mmm DD YY" (16 символов и завершающий ноль).
constexpr char FIRMWARE_VER[] = {
  __TIME__[0], __TIME__[1], __TIME__[3], __TIME__[4], __TIME__[6], __TIME__[7], ' ',
  __DATE__[0], __DATE__[1], __DATE__[2], __DATE__[3],
  (__DATE__[4] == ' ' ? '0' : __DATE__[4]), __DATE__[5], __DATE__[6],
  __DATE__[9], __DATE__[10], '\0'
};
class class_calc_config {
  public:
    bool disassm;
    bool output_IP;
    constexpr class_calc_config(void) : disassm(false), output_IP(false) {}
};

namespace cfg {

// Измеренная совместимая скорость прежнего loop-счётчика: 13 шагов за 15 с.
// Таймер задаётся в микросекундах; округление даёт ошибку меньше 1 ppm от
// целевого периода 15/13 с ещё до аппаратного квантования PSC/ARR.
static constexpr u32    CLASSIC_MK61_PERIOD_NUMERATOR = 15;
static constexpr u32    CLASSIC_MK61_PERIOD_DENOMINATOR = 13;
static constexpr u32    CLASSIC_MK61_PERIOD_US =  1153846;
static constexpr usize  MAXIMUM_MK61_BATCH_STEPS =     16;   // Сколько шагов ядра делать за один проход RUN-обвязки в режиме MAXIMUM
static constexpr t_time_ms MAXIMUM_LCD_UPDATE_MS =    120;   // Минимальная пауза между обновлениями LCD в MAXIMUM RUN
static constexpr usize  MAXIMUM_SERIAL_POLL_LOOPS =     4;   // Как часто опрашивать терминал в MAXIMUM RUN

